app/controllers/search_phrases_controller.rb

SELECT "search_phrases".* FROM "search_phrases" WHERE "search_phrases"."user_id" = ?  [["user_id", 1]]
---
  def index
    @keywords = current_user.search_phrases.all

INSERT INTO "search_phrases" ("created_at", "keyword", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 04 Nov 2013 08:39:09 UTC +00:00], ["keyword", "123456"], ["updated_at", Mon, 04 Nov 2013 08:39:09 UTC +00:00], ["user_id", 3]]
---
  def create
    @keyword = current_user.search_phrases.new(params[:search_phrase].permit(:keyword))
    if @keyword.save

SELECT "search_phrases".* FROM "search_phrases" WHERE "search_phrases"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @keyword = SearchPhrase.find(params[:id])

SELECT "search_phrases".* FROM "search_phrases" WHERE "search_phrases"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "search_phrases" SET "keyword" = ?, "updated_at" = ? WHERE "search_phrases"."id" = 4  [["keyword", "khubsoorat!"], ["updated_at", Mon, 04 Nov 2013 09:27:29 UTC +00:00]]
---
  def update
    @keyword = SearchPhrase.find(params[:id])

    if @keyword.update(params[:search_phrase].permit(:keyword))

SELECT "search_phrases".* FROM "search_phrases" WHERE "search_phrases"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "search_phrases" WHERE "search_phrases"."id" = ?  [["id", 3]]
---
  def destroy
    @keyword = SearchPhrase.find(params[:id])
    @keyword.destroy